InformationRegisters/ТорговоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ТорговоеОборудование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Comment>Параметры торгового оборудования.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель торгового оборудования.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассаККМ</Name>
					<Comment>Касса ККМ, которой соответствует данное оборудование.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Comment>Имя компьютера, к которому физически подключено данное устройство.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор подключаемого устройства.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТорговоеОборудование/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	ОК(Неопределено);
	
КонецПроцедуры // СписокВыборЗначения()


&НаКлиенте
Процедура ОК(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если (ТекущиеДанные = Неопределено) Или ПустаяСтрока(ТекущиеДанные.Идентификатор) Тогда
		Закрыть(Неопределено);
	Иначе
		ОповеститьОВыборе(Новый Структура("Идентификатор,Представление", 
			ТекущиеДанные.Идентификатор,
			ТекущиеДанные.Представление));
	КонецЕсли; 
	
КонецПроцедуры // ОК()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТорговоеОборудование.Идентификатор КАК Идентификатор,
	                      |	ТорговоеОборудование.Компьютер КАК Компьютер,
	                      |	ТорговоеОборудование.Модель КАК Представление,
	                      |	0 КАК ИндексКартинки
	                      |ИЗ
	                      |	РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
	                      |ГДЕ
	                      |	ТорговоеОборудование.Модель.ОбработкаОбслуживания.Вид = &Вид
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Компьютер,
	                      |	Представление
	                      |ИТОГИ
	                      |	ПРЕДСТАВЛЕНИЕССЫЛКИ(Компьютер) КАК Представление,
	                      |	2 КАК ИндексКартинки
	                      |ПО
	                      |	Компьютер
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Вид", Параметры.Вид);
						  
	СтруктураОборудования = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);					  
						  
	ЗначениеВДанныеФормы(СтруктураОборудования, Список);
	
	// Текущая строка.
	
	// Настройка формы.
	ЗакрыватьПриВыборе = Истина;
	
КонецПроцедуры // ПриСозданииНаСервере()
